package com.undcover.lovemusic.provider.bean;

public class Lrc163 {

    /**
     * lrc : {"version":6,"lyric":"[by:夏紫秋银]\n[00:15.74]流星（りゅうせい）の上（うえ）の 夜空（よぞら）に飛（と）び散（ち）る　princess\n[00:23.47]キラキラ煌（きら）めいてる マインドゲーム（mind game）\n[00:27.74]時間（じかん）と空間（くうかん）の中（なか）で\n[00:36.27]あの頃（ころ）は　笑（わら）ってた 二人（ふたり）だったけど\n[00:44.04]人（ひと）の心（こころ）は多情（たじょう）でウソ（嘘）もつく\n[00:51.32]おっちょこちょいな彼（かれ）と一緒（いっしょ）に居（い）ると こっちまで　Trouble!\n[00:59.36]違（ちが）う私（わたし）になるみたい come alive\n[01:07.05]肝心（かんじん）なこと コンピューター（computer）だって教（おし）えてくれない\n[01:14.31]疲（つか）れたまま明（あけ）るく装（よそお）って でも生（い）·き·て·る\n[01:21.46]流星（りゅうせい）の上（うえ）の 夜空（よぞら）に飛（と）び散（ち）る　pricess\n[01:28.69]キラキラ煌（きら）めいてる マインドゲーム（mind game）\n[01:33.12]時間（じかん）と空間（くうかん）の中（なか） 未来（みらい）のイメージ（image） ずっと焼（や）きつけて\n[01:45.09]ふたつの心（こころ）は スローモーション（slow-motion）\n[01:57.29]今（いま）の自分（じぶん）の物（もの）の見方（みかた）の状態（じょうたい）しだいで Trouble\n[02:05.30]違（ちが）う世界（せかい）がはじけるよ come alive\n[02:13.32]明日（あした）の結果（けっか）が気（き）になるのも分（わ）かるけど\n[02:20.47]君（きみ）との信頼（しんらい）だけは 失（な）くしたくないね\n[02:27.62]流星（りゅうせい）の上（うえ）の 吹（ふ）きっさらしの  prince\n[02:34.89]キラキラ煌（きら）めいてる マインドゲーム（mind game）\n[02:39.00]あなたがそこにいるから 手（て）さぐりのまま 向（む）こう側（かわ）へ行（ゆ）こう\n[02:50.32]降（ふ）りそそぐ肩（かた）には スローモーション（slow-motion）\n[03:14.29]流星（りゅうせい）の上（うえ）の 夜空（よぞら）に飛（と）び散（ち）る　princess\n[03:21.36]キラキラ煌（きら）めいてる マインドゲーム（mind game）\n[03:25.61]時間（じかん）と空間（くうかん）の中（なか）\n[03:30.51]始（はじ）めることも 踏（ふ）み込（こ）むこともしない人生（みち）なんて スローモーション（slow-motion）\n[03:44.87]流星（りゅうせい）の上（うえ）の 夜空（よぞら）に飛（と）び散（ち）る　princess\n[03:52.37]キラキラ煌（きら）めいてる マインドゲーム（mind game）\n[03:56.87]スランプ（slump）抜（ぬ）け出（で）していこう 未来（みらい）のイメージ（image） ずっと焼（や）きつけて\n[04:08.21]ふたつの心（こころ）は スローモーション（slow-motion）\n"}
     * tlyric : {"version":1,"lyric":"[by:miholic]\n[00:15.74]在飞散着流星的夜空中的princess\n[00:23.47]闪闪发光着的mind game\n[00:27.74]在时间和空间中\n[00:36.27]那个时候 笑着的两人\n[00:44.04]人的心是多情并混入谎言的\n[00:51.32]冒失的和他在一起 这真是 Trouble!\n[00:59.36]我变成了不同的样子 come alive\n[01:07.05]重要的事情 连电脑都不能告诉我\n[01:14.31]已经很累了 但是要装作很有活力的样子活着\n[01:21.46]在飞散着流星的夜空中的princess\n[01:28.69]闪闪发光着的mind game\n[01:33.12]在时间和空间中 未来的印象在心中燃烧\n[01:45.09]两个人的心 慢动作\n[01:57.29]如今自己对事物看法的状态是如此的 Trouble\n[02:05.30]展现出不同的世界  come alive\n[02:13.32]明天的结果也是早就知道的 但是\n[02:20.47]对你的信赖 我不想失去\n[02:27.62]在飞散着流星的夜空中的 prince\n[02:34.89]闪闪发光着的mind game\n[02:39.00]你在那里 探寻着 向你身边奔去\n[02:50.32]飘落在肩膀上的 慢动作\n[03:14.29]在飞散着流星的夜空中的princess\n[03:21.36]闪闪发光着的mind game\n[03:25.61]在时间和空间中\n[03:30.51]开始踏进别人的人生也做不到的 慢动作\n[03:44.87]在飞散着流星的夜空中的princess\n[03:52.37]闪闪发光着的mind game\n[03:56.87]从低迷中挣脱开吧 未来的印象在心中燃烧\n[04:08.21]两个人的心 慢动作\n"}
     * code : 200
     */

    private LrcBean lrc;
    private TlyricBean tlyric;
    private int code;

    public LrcBean getLrc() {
        return lrc;
    }

    public void setLrc(LrcBean lrc) {
        this.lrc = lrc;
    }

    public TlyricBean getTlyric() {
        return tlyric;
    }

    public void setTlyric(TlyricBean tlyric) {
        this.tlyric = tlyric;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public static class LrcBean {
        /**
         * version : 6
         * lyric : [by:夏紫秋银]
         [00:15.74]流星（りゅうせい）の上（うえ）の 夜空（よぞら）に飛（と）び散（ち）る　princess
         [00:23.47]キラキラ煌（きら）めいてる マインドゲーム（mind game）
         [00:27.74]時間（じかん）と空間（くうかん）の中（なか）で
         [00:36.27]あの頃（ころ）は　笑（わら）ってた 二人（ふたり）だったけど
         [00:44.04]人（ひと）の心（こころ）は多情（たじょう）でウソ（嘘）もつく
         [00:51.32]おっちょこちょいな彼（かれ）と一緒（いっしょ）に居（い）ると こっちまで　Trouble!
         [00:59.36]違（ちが）う私（わたし）になるみたい come alive
         [01:07.05]肝心（かんじん）なこと コンピューター（computer）だって教（おし）えてくれない
         [01:14.31]疲（つか）れたまま明（あけ）るく装（よそお）って でも生（い）·き·て·る
         [01:21.46]流星（りゅうせい）の上（うえ）の 夜空（よぞら）に飛（と）び散（ち）る　pricess
         [01:28.69]キラキラ煌（きら）めいてる マインドゲーム（mind game）
         [01:33.12]時間（じかん）と空間（くうかん）の中（なか） 未来（みらい）のイメージ（image） ずっと焼（や）きつけて
         [01:45.09]ふたつの心（こころ）は スローモーション（slow-motion）
         [01:57.29]今（いま）の自分（じぶん）の物（もの）の見方（みかた）の状態（じょうたい）しだいで Trouble
         [02:05.30]違（ちが）う世界（せかい）がはじけるよ come alive
         [02:13.32]明日（あした）の結果（けっか）が気（き）になるのも分（わ）かるけど
         [02:20.47]君（きみ）との信頼（しんらい）だけは 失（な）くしたくないね
         [02:27.62]流星（りゅうせい）の上（うえ）の 吹（ふ）きっさらしの  prince
         [02:34.89]キラキラ煌（きら）めいてる マインドゲーム（mind game）
         [02:39.00]あなたがそこにいるから 手（て）さぐりのまま 向（む）こう側（かわ）へ行（ゆ）こう
         [02:50.32]降（ふ）りそそぐ肩（かた）には スローモーション（slow-motion）
         [03:14.29]流星（りゅうせい）の上（うえ）の 夜空（よぞら）に飛（と）び散（ち）る　princess
         [03:21.36]キラキラ煌（きら）めいてる マインドゲーム（mind game）
         [03:25.61]時間（じかん）と空間（くうかん）の中（なか）
         [03:30.51]始（はじ）めることも 踏（ふ）み込（こ）むこともしない人生（みち）なんて スローモーション（slow-motion）
         [03:44.87]流星（りゅうせい）の上（うえ）の 夜空（よぞら）に飛（と）び散（ち）る　princess
         [03:52.37]キラキラ煌（きら）めいてる マインドゲーム（mind game）
         [03:56.87]スランプ（slump）抜（ぬ）け出（で）していこう 未来（みらい）のイメージ（image） ずっと焼（や）きつけて
         [04:08.21]ふたつの心（こころ）は スローモーション（slow-motion）

         */

        private int version;
        private String lyric;

        public int getVersion() {
            return version;
        }

        public void setVersion(int version) {
            this.version = version;
        }

        public String getLyric() {
            return lyric;
        }

        public void setLyric(String lyric) {
            this.lyric = lyric;
        }
    }

    public static class TlyricBean {
        /**
         * version : 1
         * lyric : [by:miholic]
         [00:15.74]在飞散着流星的夜空中的princess
         [00:23.47]闪闪发光着的mind game
         [00:27.74]在时间和空间中
         [00:36.27]那个时候 笑着的两人
         [00:44.04]人的心是多情并混入谎言的
         [00:51.32]冒失的和他在一起 这真是 Trouble!
         [00:59.36]我变成了不同的样子 come alive
         [01:07.05]重要的事情 连电脑都不能告诉我
         [01:14.31]已经很累了 但是要装作很有活力的样子活着
         [01:21.46]在飞散着流星的夜空中的princess
         [01:28.69]闪闪发光着的mind game
         [01:33.12]在时间和空间中 未来的印象在心中燃烧
         [01:45.09]两个人的心 慢动作
         [01:57.29]如今自己对事物看法的状态是如此的 Trouble
         [02:05.30]展现出不同的世界  come alive
         [02:13.32]明天的结果也是早就知道的 但是
         [02:20.47]对你的信赖 我不想失去
         [02:27.62]在飞散着流星的夜空中的 prince
         [02:34.89]闪闪发光着的mind game
         [02:39.00]你在那里 探寻着 向你身边奔去
         [02:50.32]飘落在肩膀上的 慢动作
         [03:14.29]在飞散着流星的夜空中的princess
         [03:21.36]闪闪发光着的mind game
         [03:25.61]在时间和空间中
         [03:30.51]开始踏进别人的人生也做不到的 慢动作
         [03:44.87]在飞散着流星的夜空中的princess
         [03:52.37]闪闪发光着的mind game
         [03:56.87]从低迷中挣脱开吧 未来的印象在心中燃烧
         [04:08.21]两个人的心 慢动作

         */

        private int version;
        private String lyric;

        public int getVersion() {
            return version;
        }

        public void setVersion(int version) {
            this.version = version;
        }

        public String getLyric() {
            return lyric;
        }

        public void setLyric(String lyric) {
            this.lyric = lyric;
        }
    }
}
