package com.undcover.lovemusic.provider.bean;

public class LrcQQ {

    /**
     * retcode : 0
     * code : 0
     * subcode : 0
     * lyric : [ti:MIND GAMES(Redway Secret Mix)]
     [ar:ZARD]
     [al:ZARD SINGLE COLLECTION~20th ANNIVERSARY~]
     [by:]
     [offset:0]
     [00:00.82]MIND GAMES(Redway Secret Mix) - ZARD
     [00:03.00]詞：坂井泉水
     [00:04.79]曲：綿貫正顕
     [00:06.65]
     [00:16.11]流星の上の
     [00:18.59]
     [00:19.68]夜空に飛び散るprincess
     [00:23.62]キラキラ煌いてる
     [00:26.32]マインドゲーム
     [00:27.78]時間と空間の中で
     [00:33.84]
     [00:36.77]あの頃は笑ってた
     [00:40.64]二人だったけど
     [00:44.51]人の心は多情でウソもつく
     [00:50.56]
     [00:51.64]おっちょこちょいな彼と一緒にいると
     [00:56.44]こっちまでtrouble
     [00:59.71]違う私になるみたい
     [01:03.47]Come alive
     [01:05.86]
     [01:07.73]肝心なこと
     [01:09.73]コンピューターだって
     [01:11.23]教えてくれない
     [01:13.30]
     [01:14.69]疲れたまま明るく装って
     [01:19.30]
     [01:19.85]でも生きてる
     [01:21.86]流星の上の
     [01:24.12]
     [01:24.98]夜空に飛び散るprincess
     [01:29.42]キラキラ煌いてる
     [01:31.99]マインドゲーム
     [01:33.44]時間と空間の中未来のイメージ
     [01:41.31]ずっと焼きつけて
     [01:43.86]
     [01:45.07]ふたつの心はスローモーション
     [01:51.04]
     [01:57.33]今の自分の物の見方の状態しだいでtrouble
     [02:05.37]違う世界がはじけるよ
     [02:09.01]I come alive
     [02:11.36]
     [02:13.32]明日の結果が気になるのも分かるけど
     [02:18.96]
     [02:20.57]君との信頼だけは失くしたくないね
     [02:27.57]流星の上の吹きっさらしのprince
     [02:35.05]キラキラ煌いてる
     [02:37.65]マインドゲーム
     [02:39.10]あなたがそこにいるから
     [02:44.05]手さぐりのまま向こう側へ行こう
     [02:49.43]
     [02:50.73]降りそそぐ肩にはスローモーション
     [02:56.58]
     [03:14.21]流星の上の夜空に飛び散るprincess
     [03:21.52]キラキラ煌いてる
     [03:24.00]マインドゲーム
     [03:25.60]時間と空間の中
     [03:30.61]始めることも
     [03:33.51]踏み込むこともしない
     [03:38.24]人生なんてスローモーション
     [03:43.09]
     [03:44.67]流星の上の
     [03:47.38]
     [03:48.23]夜空に飛び散るprincess
     [03:52.59]キラキラ煌いてる
     [03:55.26]マインドゲーム
     [03:56.85]スランプ抜け出していこう
     [04:01.81]未来のイメージ
     [04:04.57]ずっと焼きつけて
     [04:07.15]
     [04:08.20]ふたつの心は
     [04:11.29]スローモーション
     [04:14.48]

     * trans : [ti:MIND GAMES(Redway Secret Mix)]
     [ar:ZARD]
     [al:ZARD SINGLE COLLECTION~20th ANNIVERSARY~]
     [by:]
     [offset:0]
     [00:00.82]//
     [00:03.00]//
     [00:04.79]//
     [00:06.65]
     [00:16.11]在流星划过的夜空
     [00:18.59]
     [00:19.68]飘然落下美丽的公主
     [00:23.62]闪耀着耀眼的光芒
     [00:26.32]如心理游戏般
     [00:27.78]在时间和空间之中
     [00:33.84]
     [00:36.77]那个时候我们欢笑着
     [00:40.64]虽然只有两个人
     [00:44.51]因为人的多情而充满了谎言
     [00:50.56]
     [00:51.64]和冒失的他在一起
     [00:56.44]尽是麻烦甚至到了这种地步
     [00:59.71]似乎要做不一样的自己
     [01:03.47]我充满了活力
     [01:05.86]
     [01:07.73]重要的事情
     [01:09.73]即便是电脑
     [01:11.23]也不从知晓
     [01:13.30]
     [01:14.69]内心一直疲倦 却拿出一份明亮的装扮
     [01:19.30]
     [01:19.85]就这样活着
     [01:21.86]在流星之上的夜空
     [01:24.12]
     [01:24.98]飘然落下美丽的公主
     [01:29.42]闪耀着耀眼的光芒
     [01:31.99]如心理游戏般
     [01:33.44]在时间和空间之中 未来的印象
     [01:41.31]一直炽烈地燃烧着
     [01:43.86]
     [01:45.07]两个人的心 开启了慢动作模式
     [01:51.04]
     [01:57.33]按照自己的价值观尽是麻烦
     [02:05.37]似乎要开启不一样的世界
     [02:09.01]我充满了活力
     [02:11.36]
     [02:13.32]我知道你在意明日的结果
     [02:18.96]
     [02:20.57]不想失去你我之间的信赖
     [02:27.57]在流星之上飘然落下的公主
     [02:35.05]闪耀着耀眼的光芒
     [02:37.65]如心理游戏般
     [02:39.10]因为你就在那里
     [02:44.05]试探着朝着彼岸前进
     [02:49.43]
     [02:50.73]缓缓地降落在肩膀上 开启了慢动作模式
     [02:56.58]
     [03:14.21]在流星划过的夜空 飘然落下美丽的公主
     [03:21.52]闪耀着耀眼的光芒
     [03:24.00]如心理游戏般
     [03:25.60]在时间和空间之中
     [03:30.61]不要开始
     [03:33.51]也不要踩入
     [03:38.24]人生啊 开启了慢动作模式
     [03:43.09]
     [03:44.67]在流星划过的夜空
     [03:47.38]
     [03:48.23]飘然落下美丽的公主
     [03:52.59]闪耀着耀眼的光芒
     [03:55.26]如心理游戏般
     [03:56.85]摆脱低迷的生活
     [04:01.81]未来的印象
     [04:04.57]一直炽烈地燃烧着
     [04:07.15]
     [04:08.20]两个人的心
     [04:11.29]开启了慢动作模式
     [04:14.48]

     */

    private int retcode;
    private int code;
    private int subcode;
    private String lyric;
    private String trans;

    public int getRetcode() {
        return retcode;
    }

    public void setRetcode(int retcode) {
        this.retcode = retcode;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public int getSubcode() {
        return subcode;
    }

    public void setSubcode(int subcode) {
        this.subcode = subcode;
    }

    public String getLyric() {
        return lyric;
    }

    public void setLyric(String lyric) {
        this.lyric = lyric;
    }

    public String getTrans() {
        return trans;
    }

    public void setTrans(String trans) {
        this.trans = trans;
    }
}
